package com.wu.common.exception.base;

/**
 * Created by zhengganglee on 16/9/21.
 */
public enum CommonExceptionEnum {

    LC00001("系统繁忙，请稍后再试！"),

    PO00001("今日已经签到了"),

    US00001("绑卡失败"),
    US00002("该银行卡不能删除"),
    US00003("用户名不存在"),
    US00004("密码错误"),
    US00005("账户不可用"),
    US00006("验证码错误"),
    US00007("验证码发送失败"),
    US00008("实名认证失败，姓名与身份证不一致！"),
    US00009("该身份证已经被认证"),
    US00010("登录已超时！"),
    US00011("该手机号已被注册"),
    US00012("用户手机号与身份证号不匹配"),
    US00013("原始密码错误！"),
    US00014("请绑定储蓄卡！"),
    US00015("银行卡号错误！"),
    US00016("银行卡校验失败！"),
    US00017("邀请码错误！"),
    US00018("设置默认银行卡失败！"),
    US00019("未登录！"),
    US00020("该银行卡已经被绑定！"),
    US00021("余额不足！"),
    US00022("请填写身份证信息！"),

    PT00001("不存在该标的！"),


    CP00001("无效的券码!"),
    CP00002("红包已被使用!"),
    CP00003("红包已过期!"),
    CP00004("不满足红包使用条件!"),
    CP00005("优惠券数量不足!"),
    CP00006("优惠券批次ID不存在!"),
    CP00007("优惠券预算不足!"),
    CP00008("注册奖励优惠券已经发放完了!"),
    CP00009("优惠券码无效!"),
    CP00010("优惠券已过期!"),
    CP00011("优惠券已使用，不能再次使用!"),
    CP00012("不满足优惠券使用条件!"),
    CP00013("添加加息券失败!"),
    CP00014("生成优惠券失败!"),
    CP00015("红包数量必须大于0!"),
    CP00016("该批次优惠券已存在!"),
    CP00017("红包面值应该小于投资金额!"),


//    CP00001("无效的红包券码"),
//    CP00001("无效的红包券码"),
//    CP00001("无效的红包券码"),
//    CP00001("无效的红包券码"),

    AT00001("无效的活动ID"),
    AT00002("活动发放奖励失败！"),
    AT00003("活动尚未完成，不能领取奖品！"),
    AT00004("参加活动次数已达最高次数限制，不能再参加此活动！"),
    AT00005("此活动尚未完成，不能重复参加活动！"),
    AT00006("已经参加过注册领红包活动，不能重复参与！"),



    TR00001("支付平台返回信息"),
    TR00002("请先发送验证码！"),
    TR00003("标的余额不足！"),
    TR00004("银行卡未绑定"),
    TR00005("没有生成订单，请重新购买"),
    TR00006("余额支付"),
    TR00007("不支持投标，请联系客服"),
    TR00008("账户余额不足"),
    TR00009("需要查询充值状态"),















    AT10003("");

//    ========Demo
//    JS00002("该账户已被绑定，不能重复绑定！"),
//    JS00003("该xxx账户已绑定账户，不能重复绑定！"),
//    JS00004("未找到任何数据！"),
//    JS00024("用户不存在！"),
//    JS00025("账号在其它地方登录，请重新登录！"),
//    JS00026("登出失败."),
//    JS00027("转账失败."),
//    JS00028("账号余额不足"),
//    JS00029("未绑定任何银行账号"),
//    JS00030("未知的交易所代码!"),
//    JS00031("邮箱格式不正确!"),
//    JS00032("无效用户"),
//    JS00033("手机号码已经存在！"),
//    JS00034("姓名与身份证不一致"),
//    JS00035("操作失败"),
//    JS00036("邮件发送失败"),
//    JS00038("非法注册，请联系客服"),
//    JS00039("该邮箱已被注册"),
//    JS00052("账号错误"),



    private String Outcome;

    private String Message;

    CommonExceptionEnum(String message) {
        Outcome = toString();
        Message = message;
    }

    public String getOutcome() {
        return Outcome;
    }

    public String getMessage() {
        return Message;
    }

}
